In [ ]:
Question-17
Below is a snippet from a table that contains information about employees that work at Company XYZ: 
Column name	Data type	Example value	Description
employee_name	string	Cindy	Name of employee
employee_id	integer	1837204	Unique id for each employee
yrs_of_experience	integer	14	total working years of experience
yrs_at_company	integer	10	total working years at Company XYZ
compensation	integer	100000	dollar value of employee compensation
career_track	string	technical	Potential values: technical, non-technical, executive

Company XYZ Human Resource department is trying to understand compensation across the company
and asked you to pull data to help them make a decision regarding employee compensation.

Question: Can you pull the average, median, minimum, maximium, and standard deviations for salary across 5 year
experience buckets at Company XYZ? (e.g. get the corresponding average, median, minimum, maximium, and standard deviations for expereience buckets 0-5, 5-10, 10-15, ect.)
You can assume the data is imported into a dataframe named df.

In [2]:
import pandas as pd
df=pd.read_csv('/Users/chidam/Desktop/emp_data.csv')
df.head()

  emp_name   emp_id  yrs_experience  yrs_company  compensation career_track
0    Cindy  1837204              12            5        100000    technical
1    Wendy  1837205              16            6        323456        sales
2      Won  1837206              17            7        100002         engg
3    Peter  1837207               8            8        122345    marketing
4     Jack  1837208              19            9        100004       design

In [9]:
Can you pull the average for salary across 5 year experience buckets at Company XYZ?
#because the question asks for years of experience at the xompany XYZ I have considered the yrs_company column to filter
#the appropriate data

df.loc[df['yrs_company']==5, 'compensation'].mean()

327525.8

In [22]:
Median for salary across 5 year experience buckets at Company XYZ?

df.loc[df['yrs_company']==5, 'compensation'].median()

289040.0

In [25]:
Minimum value in the column - 5 year experience bucket
df.loc[df['yrs_company']==5, 'compensation'].min()

100000

In [26]:
Maximum value in the column - 5 year experience bucket
df.loc[df['yrs_company']==5, 'compensation'].max()

567900

In [30]:
Standard Deviation of the column - in the 5-year experience bucket
df.loc[df['yrs_company']==5, 'compensation'].std()

186061.94115992662

In [21]:
#Calculating average for expereience buckets 0-5. the same format can be applied to select other categories of experience buckets
#do not forget the brackets around the column selections below - otherwise it will throw amgiguous value error

df.loc[(df['yrs_company']>=1) & (df['yrs_company']<=5), 'compensation'].mean()

344639.1666666667

In [24]:
#To find median salary across expereience buckets 0-5 at Company XYZ?

df.loc[(df['yrs_company']>=1) & (df['yrs_company']<=5), 'compensation'].median()

289036.5

In [28]:
#Minimum value in the column 0 - 5 year experience bucket
df.loc[(df['yrs_company']>=1) & (df['yrs_company']<=5), 'compensation'].min()

100000

In [29]:
#Maximum value in the column 0 - 5 year experience bucket
df.loc[(df['yrs_company']>=1) & (df['yrs_company']<=5), 'compensation'].max()

765123

In [31]:
Standard Deviation of the column - in the 0-5 year experience bucket
df.loc[(df['yrs_company']>=1) & (df['yrs_company']<=5), 'compensation'].std()

188186.3769737734